# Проект: Барбершоп "The Black Razor"

# Общий функционал:
# 1. Регистрация
# 2. Смена языка (Русский, Английский)

# Роли:
# 1. Администратор
# 1.1. Создавать профиль сотрудника
# 1.2. Возможность записывать клиента
# 1.3. Смотреть записи клиентов
# 1.4. Возможность связаться с клиентом
# 1.5. Создавать услуги

# 2. Барбер
# 2.1. Смотреть кто у него по расписанию
# 2.2. Возможность связаться с клиентом

# 3. Клиент
# 3.1. Записаться на стрижку (выбрать услуги, выбрать барбера)
# 3.2. Связаться с администратором и отметить запись или перенести
# 3.3. Оценка услуги

# Технологии:
# 1. Python
# 1.1. aiogram
# 1.2. psycopg2

# 2. SQL
# 2.1/ PostgreSQL
